-- MySQL dump 10.13  Distrib 8.0.28, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: my_db
-- ------------------------------------------------------
-- Server version	8.0.28

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `task`
--

DROP TABLE IF EXISTS `task`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `task` (
  `id_task` bigint NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL,
  `is_executed` int DEFAULT NULL,
  `start` varchar(255) DEFAULT NULL,
  `end` varchar(255) DEFAULT NULL,
  `owner` varchar(255) DEFAULT NULL,
  `task_type` varchar(255) NOT NULL,
  `description` varchar(5000) DEFAULT NULL,
  `parent_task_id` int DEFAULT NULL,
  `user_id` bigint NOT NULL,
  PRIMARY KEY (`id_task`)
) ENGINE=InnoDB AUTO_INCREMENT=240 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `task`
--

LOCK TABLES `task` WRITE;
/*!40000 ALTER TABLE `task` DISABLE KEYS */;
INSERT INTO `task` VALUES (212,'Створити ToDoList',1,'2022-05-01T10:00','2022-05-25T10:00',NULL,'project','Створити проект, який допоможе людям організовувати власні задачі, які хочуть зайнятись тайм-менеджментом і просто хочуть зробити своє життя трохи простішим.',NULL,71),(213,'Розробити дизайн',1,'2022-05-02T00:00','2022-05-05T00:00',NULL,'project','Розробка повного дизайну сайту з власною палтрів кольорів шрифтами.',212,71),(214,'Зверстати сайт',1,'2022-05-05T10:13','2022-05-07T10:13',NULL,'project','Зверстати сторінки: реєстрації, логіна , головну, проекти, користувачі, лист-очікування, нотатки, форми змін/видалення/додавання, календар, підтвердження пошти.',212,71),(215,'Додати функціонал за допомогою JS',1,'2022-05-10T10:16','2022-05-20T10:16','','project','Валідація дат, робота з checkbox, бургер меню, слайдер, виклик форм, закреслення виконананих завдань.',212,71),(216,'Додати BACK-END',1,'2022-05-13T10:19','2022-05-23T10:19',NULL,'project','Реалізація календаря, реєстрації, статистики, додавання задач, видалення, зміна. Додати БД.',212,71),(217,'Доробити!!!!!',0,'2022-05-24 10:29:34',NULL,NULL,'notes','1. ПІДТВЕРДЖЕННЯ РЕЄСТРАЦІЇ ЧЕРЕЗ ПОЧТУ\n2. ПРИ НАТИСНЕННІ НА ТАСКУ ВИВОДИТИ ОПИС\n3. ВИБІР ТЕМИ\n4. ВИБІР МОВИ\n5. ПРИ ЗАХИСТІ ЩОБ БУЛИ РЕАЛЬНІ НОТАТКИ/ТАСКИ',NULL,71),(219,'ПРОСТИЙ РЕЦЕПТ БАНАНОВОГО ПУДИНГУ З МОРОЗИВОМ',0,'2022-05-24 10:35:44',NULL,NULL,'notes','1. У НЕВЕЛИКУ КАСТРУЛЮ НАЛИВАЄМО МОЛОКО ТА НАСИПАЄМО ПРОСІЯНЕ ЧЕРЕЗ СИТО БОРОШНО.\n2. ЗА ДОПОМОГОЮ МІКСЕРА ЗБИВАЄМО МУКУ ТА МОЛОКО ДО ПОВНОГО РОЗЧИНЕННЯ ГРУДОЧОК.\n3. ВІДДІЛЯЄМО ЖОВТКИ ВІД БІЛКІВ. ПОМІЩАЄМО ЖОВТКИ В ОКРЕМУ МИСКУ, ДОДАЄМО ЗВИЧАЙНИЙ ТА ВАНІЛЬНИЙ ЦУКОР. ПЕРЕМІШУЄМО.\n4. ПЕРЕКЛАДАЄМО ЦУКРОВО-ЯЄЧНУ МАСУ ДО СУМІШІ БОРОШНА ТА МОЛОКА. ЗБИВАЄМО ДО ОДНОРІДНОЇ КОНСИСТЕНЦІЇ.\n5. СТАВИМО КАСТРУЛЮ НА СЛАБКИЙ ВОГОНЬ ТА НАГРІВАЄМО СУМІШ 2–3 ХВИЛИНИ, ПОСТІЙНО ПОМІШУЮЧИ.\n6. КОЛИ МАСА ЗАГУСНЕ, ЗНІМАЄМО КАСТРУЛЮ З ВОГНЮ. ДО СУМІШІ ДОДАЄМО ВЕРШКОВЕ МАСЛО ТА ПЕРЕМІШУЄМО. ЧЕКАЄМО, ПОКИ СУМІШ ОХОЛОНЕ.\n7. ОДИН БАНАН РІЖЕМО НА ШМАТОЧКИ ТА ПЕРЕКЛАДАЄМО В ЧАШУ БЛЕНДЕРА. ВИКЛАДАЄМО ЧАСТИНУ ПУДИНГУ З КАСТРУЛІ ТА ПОДРІБНЮЄМО ІНГРЕДІЄНТИ ПРОТЯГОМ КІЛЬКОХ ХВИЛИН — ДО КРЕМОВОЇ КОНСИСТЕНЦІЇ.\n8. БАНАН, ЯКИЙ ЗАЛИШИВСЯ, НАРІЗАЄМО КРУЖАЛЬЦЯМИ, ПЕЧИВО ЛАМАЄМО НЕВЕЛИЧКИМИ ШМАТОЧКАМИ.\n9. НА ДНО КРЕМАНОК ВИКЛАДАЄМО БАНАНИ ТА ПЕЧИВО, ЗВЕРХУ — ШАР ПУДИНГУ ТА КУЛЬКУ МОРОЗИВА. ПОВТОРЮЄМО ПОСЛІДОВНІСТЬ ДО ПОВНОГО НАПОВНЕННЯ СКЛЯНОК. ЗАЛИШАЄМО ПУДИНГ У ХОЛОДИЛЬНИКУ НА КІЛЬКА ГОДИН.',NULL,71),(220,'Підготуватись до модулю',1,'2022-05-24T10:39','2022-05-25T10:39','Брат','waiting-for','Будуть тестові завдання. Перша пара. Алгоритмізація',NULL,71),(221,'Помити машину',0,'2022-05-26T10:41','2022-05-26T10:41','Батько','waiting-for','Мийка 1200м від дому',NULL,71),(222,'КУПИТИ ТЕЛЕФОН',0,'2022-05-31T10:42','2022-07-01T00:00','Мама','waiting-for','Бюджет 7 000 грн',NULL,71),(223,'Піти на прогулянку',0,'2022-05-26T20:00','2022-05-26T22:00',NULL,'simple','Прогулянка - це хороше завершення дня! ',NULL,71),(224,'Прибрати кімнату',1,'2022-05-25T16:45','2022-05-25T18:45',NULL,'simple','Вдома має бути чисто.',NULL,71),(226,'Поїхати за кордон',0,'','','','someday-maybe','Для того, щоб розширити кругозір і відпочити',NULL,71),(227,'Зробити ремонт',0,'2022-05-24 10:50:34',NULL,NULL,'someday-maybe','Потрібний ремонт в коридорі',NULL,71),(230,'Захист проекту',1,'2022-05-25T10:00','2022-05-25T10:25',NULL,'project','текст',212,71),(235,'Еіваі',0,'2022-05-24T21:08','2022-05-24T21:08','','simple','апвапрвапв',NULL,71),(237,'Викано завдання 1',0,'2022-05-24T21:14','2022-05-24T21:16',NULL,'project','варапрапр',236,71),(239,'dhfh',0,'2022-05-25T11:24','2022-05-25T11:24','','simple','fghhgfjghjg',NULL,71);
/*!40000 ALTER TABLE `task` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-05-27 17:48:30
